JS/BenchBNB/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
---
    def index
        @all_benches = Bench.all

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at", "number_of_seats") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "fuckin bench yay"], ["lat", 47.0], ["lng", -122.0], ["created_at", "2018-02-18 21:03:01.006774"], ["updated_at", "2018-02-18 21:03:01.006774"], ["number_of_seats", 69]]
---
    def create
        @bench = Bench.create!(bench_params)

SELECT  "benches".* FROM "benches" WHERE "benches"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "benches" WHERE "benches"."id" = $1  [["id", 21]]
---
    def destroy

        @bench = Bench.find(params[:id])
        @bench.destroy